[
    {
      "date": "2020-10-01T00:00:00",
      "title": "Spirit of Truth",
      "anchor_scripture": "John 16:13",
      "memory_verse": "\"Howbeit when he, the Spirit of truth, is come, he will guide you into all truth: for he shall not speak of himself; but whatsoever he shall hear, that shall he speak: and he will shew you things to come.\"",
      "beloved_message" : "We can never underestimate the role of the Holy spirit in our lives. Our lord Jesus Christ made it clear that he is the spirit to guide and teach us all truth meaning by ourselves or by the flesh we may never come to that perfection. The Holy spirit is the third in the Trinity and he speaks what the father says as well.  Do you have the Holy spirit in you? If not ask him by faith to come into your life and he will. Many has neglected the place of fellowship with the Holy spirit. You fellowship with him when you recognise his presence in your life and yield to his leading.",
      "further_reading": "John16, Luk 4",
      "prayer_mall": "Heavenly Father, thank you for your word. I receive grace to walk with the holy spirit and to yield to his leading in Jesus name, Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-02T00:00:00",
      "title": "Not Carnality but Christ",
      "anchor_scripture": "Col 3:1",
      "memory_verse": "\"If then were raised with Christ, seek those things which are above, where Christ is, sitting at the right hand of God.\"",
      "beloved_message" : "The life we live is no longer ours therefore we need to take conscious effort to see to it that all that doesn't please God is daily removed from our lives. This decision also should affect our life priority. A carnal life s a life void of the total experience of God's promise. Being carnally minded is being friends with the world. A carnal mind will want to understand before obeying the word of God. A carnal mind will lust after fleshy and material things. Put carnality aside and let Christ rule in you. To be carnally minded is death but to be in Christ is life. Are you still struggling with the flesh, lack of self control, Laziness and lust? You can't get rid of this with willpower but rather with the power in Jesus Christ. Come to him today, ask him to come into your life and situation. For we are called to live in Christ and not carnality.",
      "further_reading": "Col 3, Gal5",
      "prayer_mall": "Heavenly Father, thank your for your word. Rid me of every carnality in my life. Help me to daily thirst for your presence in Jesus Name. Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-03T00:00:00",
      "title": "Make it plain",
      "anchor_scripture": "Hab 2:2",
      "memory_verse": "\"Write the Vision and make it plain\"",
      "beloved_message" : "A life without vision is like a traveller without a map. Vision is a clear picture of your destination. God always reveal this to us when we inquire of him. But it's not enough to know where you want to go, you also need to write it down and make it simple to yourself to understand. Some people are so excited about how big and good their vision is and the only thing they do is to celebrate it without working it out. Your thoughts become clearer when they flow through your fingers. God wants you to write down that vision, dream and goal, first for you to understand it better and secondly for others to help you. Nobody will ever want to invest in a vague idea or vision even if you are convinced it's from God. Applied revelation brings about the breakthrough,  Don't let it die under your cover cloth, write it out and run with it. Are you yet to get a direction? Enquire from God.",
      "further_reading": "Hab2, Isa 40",
      "prayer_mall": "Heavenly Father, thank you for your word. I receive grace not be careless about my life's  vision. Help me see it clearer in Jesus Name, Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-04T00:00:00",
      "title": "So Much Thought, Less action",
      "anchor_scripture": "Prov. 21:25",
      "memory_verse": "\"The desire of the slothful killeth him; for his hands refuse to labour\"",
      "beloved_message" : "It is good to have good desires, aspiration and ambition. It is not also a sin to have big dreams and make out a great plan for impact but remember that great faith requires so much more work. Don't just sit and wait that all you wish for will just be yours, God doesn't work that way. An idea is good but don't celebrate just the thought of the idea or start sharing and priding over how beautiful the idea is. There is no time in the history of the world that an idea in the thought form changed the world but rather idea that has been processed into action and it has been acted upon. Quit celebrating ideas and building castle in the air without getting enough foundation to link your castle and the earth.You may say yes! I received a prophesy that I will be rich but if you don't act accordingly it will never be fulfilled. Depression sets in when there's a lot of inspiration without expression. Has God given an idea? Quit being slothful and act on it. Follow that passion with action. Are you praying for money? God releases money to us in form of ideas, so see it this way that every idea you fail to act upon you lose money. Start acting on those thoughts.",
      "further_reading": "Pro21, Eph3",
      "prayer_mall": "Heavenly Father, thank you for your word. Take away every slothful spirit from my life in Jesus' Name, Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-05T00:00:00",
      "title": "To Your Faith Add Work",
      "anchor_scripture": "Heb 11: 1-2",
      "memory_verse": "\"Now faith is the substance of things hoped for, the evidence of things not seen.  For by it the elders obtained a good report.\"",
      "beloved_message" : "If faith is the substance that means it should be something tangible, an action instead of just a state of believe. Faith makes heavenly things possible on earth by the way of God through men. You need to know that for whatsoever you want from God you need to make substantial move to get it on earth. Just believing is not enough, if all the great men and women of faith never made a move we won't hear and read about them. What do you believe God for? You need to make moves. Don't sit and pray for money, make a move and start a business. Don't spend all the time praying for marriage, make yourself marriageable by building good character. Don't think promotion will automatically come from that job, by faith make move and be the best staff there is in your comany. Don't think God will come down and help you write that exams without you reading, read and see him take control for you. God steps in where your strength fails, but if you are not using your strength you give no room for him to step in.",
      "further_reading": "Heb 11, Pro24",
      "prayer_mall": "Heavenly Father, thank you for your word. I receive grace to add work to my faith in Jesus Name, Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-06T00:00:00",
      "title": "Crush that Giant",
      "anchor_scripture": "1 Sam 17:37",
      "memory_verse": "\"David said moreover, The Lord that delivered me out of the paw of the lion, and out of the paw of the bear, he will deliver me out of the hand of this Philistine. And Saul said unto David, Go, and the Lord be with thee.\"",
      "beloved_message" : "There are different forms of giant in our lives on the path to destiny. But you have to daily remind yourself of God's word and what he has done. Giants are all the same they only take different forms according to the situation at hand. David's confidence was not in his skillfulness of how to use a slingshot but on how God is able to deliver him. What are you faced with? Is it the giant of  sickness, failure, addiction etc. Don't be afraid like David's brothers. Stand on God's word and face that giant. The word of the lord always overcome. David solved a national problem just by standing on the word of God and his testimonies. The word of God is a double edge sword that can crush all forms of giant. Use it today.",
      "further_reading": "1 Sam17, Pro 20",
      "prayer_mall": "Heavenly Father, thank you for your word. Help me to daily walk in your word. I receive confidence to face and  conquer all giants in my life in Jesus' Name, Amen",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-07T00:00:00",
      "title": "Rejoice in the Lord Always",
      "anchor_scripture": "Philippians 4:4",
      "memory_verse": "\"Rejoice in the Lord always: and again I say, Rejoice\"",
      "beloved_message" : "These  words were emphasized because often we tend to want to make what we see, where we are and what we possess as the source of our Joy. The only source of Joy and inspiration that never fails is in the Lord. When you rejoice in the Lord it shut out every prevailing circumstances around you, it brings you peace in the storm. Satan's winning tool is fear, don't let it get hold of you. So today rejoice in the Lord, its the sure way to escape  depression from recession. Whatever the case don't give room to fear, speak the word of God and obey his commandment. Then you will flourish regardless of what is going on in your environment. Launch into this week knowing fully well that nothing can spoil your joy.",
      "further_reading": "Pro 26, Ps 20",
      "prayer_mall": "Heavenly Father, thank you for your word. I receive grace to rejoice in you always. In Jesus Name. Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-08T00:00:00",
      "title": "Disobedience brings Death",
      "anchor_scripture": "Eph 2:1 (GNT)",
      "memory_verse": "\"In the past you were spiritually dead because of your disobedience and sins.\"",
      "beloved_message" : "The major reason why God place his word to guide us is to protect us from what we cannot see. Over time there are several accounts of people  who disobeyed and suffer great consequences. God's word to us are life and they are also instructions that governs how we live on earth.  Do everything in your power and with the help of the holy spirit to remain obedient to God.Where have you disobeyed God? Today is a day of making amendment. He want you to obey not because of him but because of you. Reach to God this morning and ask for mercy. The sure reward for disobedience is death when the one living in disobedience refuse to repent. Say a word of prayer to him.",
      "further_reading": "Eph 2, Pro7",
      "prayer_mall": "Heavenly Father, thank you for your word. Have mercy on me in any way I have disobeyed you. I ask for grace to walk in obedience everyday of my life. In Jesus' name. Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-09T00:00:00",
      "title": "You are not Forgotten",
      "anchor_scripture": "PHI 1:6 (EEV)",
      "memory_verse": "\"I know that God has begun to do good things in you. And he will continue to work in you until the day when Jesus Christ returns. Then God will finish this work in you. I am sure about that\"",
      "beloved_message" : "Sometimes its easy to feel forgotten especially when God's promises  seems to be taking too long for man's calendar. God is our beginning and end so don't conclude on him by what's happening in the middle. Has God started a thing in your life? Why don't you trust him to finish it, has he  given you a promise through his word ? why don't you wait on it. God is the perfect timer for he owns time. It's never too early or too late with God. Hold him by his word, for he said heaven and earth will pass away but not his word. So thank him today for sure blessing and rejoice in advance for it will surely come.",
      "further_reading": "Phi1, Ps4. Pro 23",
      "prayer_mall": "Heavenly Father, thank you for your word. I ask for the patience to wait on you and not miss any of your promises for me. In Jesus .Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-10T00:00:00",
      "title": "Who are you?",
      "anchor_scripture": "Acts 19:15",
      "memory_verse": "\"And the evil spirit answered and said, Jesus I know, and Paul I know; but who are ye?\"",
      "beloved_message" : "In this story above, the sons of Sceva felt that just because they did the same things as Paul and Peter, they were also believers like them, and the enemy made a mockery of them. Your identity in Christ doesn't come from the things you do like every other believer; it comes from accepting Jesus, knowing and encountering His person, and the relationship you develop with Him daily. You are not a Christian just because you go to church or sing in the choir; that's service in the house of God, and it is very different from fellowship with God. More than your works, God is interested in your heart and where it really belongs. Take a stand to discover and exercise your identity in Christ, and take your walk with Him deeper this season.",
      "further_reading": "Luke 10:38-42",
      "prayer_mall": "Heavenly Father, I thank you for your word. I receive grace to walk with you and establish my identity as your child in Jesus name. Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-11T00:00:00",
      "title": "Begin with God",
      "anchor_scripture": "1 Samuel 30:8",
      "memory_verse": "\"And David enquired at the LORD, saying, Shall I pursue after this troop? shall I overtake them? And he answered him, Pursue: for thou shalt surely overtake them, and without fail recover all.\"",
      "beloved_message" : "Many times, we don't include God at the beginning of our plans. We wait until we run into some kind of trouble, and then, we see the need to call upon God to help us out. But involving God ought to be at the beginning of any project you set out to do. Don't make God the extra tyre that is just kept in the boot of your car until some kind of trouble comes up, but make Him the wheel that directs the affairs of your life and all that you are involved in. Involve Him in your choices and decisions, no matter how trivial you think they are. God loves you and calls you His friend because you know what He does; but does He know what you do before you begin? Make God a partner today. This way, God becomes a friend that equally wants that business to succeed, and not a \"repair guy\" you desperately run to for help.",
      "further_reading": "Genesis 24:10-15",
      "prayer_mall": "Heavenly Father, I thank you for your word. I receive grace to always involve you at the beginning of all my plans in Jesus name. Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-12T00:00:00",
      "title": "Where are you now?",
      "anchor_scripture": "Joshua 13:1",
      "memory_verse": "\"Now Joshua was old and stricken in years; and the LORD said unto him, Thou art old and stricken in years, and there remaineth yet very much land to be possessed.\"",
      "beloved_message" : "Feeling fulfilled after a great achievement is such a great feeling. But many of us choose to rest at this point, and fail to pursue the big picture God has shown us. When God was creating the earth, He made so many beautiful things, and He would stop and say \"this is very good\", but that wasn't the end. The next day, morning and evening, He would do something even far more creative, and also say \",this is very good\". As God's children, we must be like Him. It isn't enough to stop and admire our achievements, but we must keep pressing on for higher things. What have you achieved this year? What were your plans when the year began? Have you met them? Have you started setting new goals for yourself? Take an evaluation of where you are right now, and where you are headed, and it would shock you that there is still so much to be done. Rest a while, but get busy afterwards.",
      "further_reading": "Philippians 3:12-15",
      "prayer_mall": "Heavenly Father, I thank you for your word. I receive grace to keep pressing towards higher goals, that I may achieve your purpose for my life in Jesus name. Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-13T00:00:00",
      "title": "The state of your heart",
      "anchor_scripture": "1 Samuel 16:7",
      "memory_verse": "\"But the LORD said unto Samuel, Look not on his countenance, or on the height of his stature; because I have refused him: for the LORD seeth not as man seeth; for man looketh on the outward appearance, but the LORD looketh on the heart.\"",
      "beloved_message" : "God doesn't see as man sees. While man looks at the outward facial expressions and gesticulations, God is busy looking at the intent of your heart. Many times, the reasons why our prayers are not yet answered is not because we don't pray enough, or because we are not committed in our service to God, but He has seen our future ahead of us, and has seen just how we would behave when those blessings come. When Samuel went to anoint the next king of Israel after Saul had fallen, when he saw Eliab, he felt that Eliab was strong and had all the physical qualities of a king, but God rejected him because his heart was not right. Your intentions weigh more than your expressions in the sight of God. That's where His eyes really are. It's time to take a spiritual scan of your heart, and not be ashamed to pray just like David, \"search my heart oh God...\"",
      "further_reading": "Matthew 2:8-12",
      "prayer_mall": "Heavenly Father, I thank you for your word. I receive grace to always let you search my heart and correct whatever is not like you in me in Jesus name. Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-14T00:00:00",
      "title": "Empty Soul",
      "anchor_scripture": "Pro 19:2a",
      "memory_verse": "\"Also, that the soul be without knowledge, it is not good..\"",
      "beloved_message" : "One of the major tactics of  Satan is to ensure that the children of God  are void of his knowledge. He can allow you do other things but when it comes to you sitting to study he will always inflict you with several distraction and self suggested excuses not to get the word of God into your soul and spirit. You can't afford to be empty as a child of God, for this will create a loophole for the enemy to toss you to and fro. How can you get this done? Self discipline is needed to overcome distraction. The flesh has to be beaten under subjection and it has to be done by you. Don't wait until you feel like it because those who act by the way they feel don't accomplish much . Satan prey on an empty soul so don't allow yours to be empty. Daily feed on the word of God. Let it guide you away from sin and lead you into God's plan for your life.",
      "further_reading": "Pro19, John1",
      "prayer_mall": "Heavenly Father, thank you for your word. Take away every distraction from my life. Help me to daily study and dwell richly in your word. In Jesus Name Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-15T00:00:00",
      "title": "Egypt or Goshen",
      "anchor_scripture": "Exodus 8:22",
      "memory_verse": "\"But I will spare the region of Goshen, where my people live, so that there will be no flies there. I will do this so that you will know that I, the Lord, I am at work in this land.\"",
      "beloved_message" : "Since the days of Joseph to the days of Moses and beyond, Goshen remains a part of Egypt that was not affected with the prevailing conditions in Egypt. When there was famine none happened in Goshen, when the Egyptians where being punished with the ten plagues none came to Goshen. God made Goshen a place for his children, those who choose to do his will, who trust him with all their heart. No matter the condition of this present economy there is a Goshen for you. You have a choice to chose where you want to belong. God provided for those in Goshen and they never lacked supply. What you hear about the economy may be the fact but there is a Goshen for you. A land where God is the president and the economy is ever booming, the land is fertile and resources is in abundance. He always brings supply according to his riches and glory not according to national budget. There is a spiritual Goshen that exist till date and that's God's covering and provision. The invitation is unlimited. Join and enjoy God's abundance.",
      "further_reading": "Ps 23, Philip 4:8",
      "prayer_mall": "Heavenly Father, thank you for your word. Thank you for your divine provision. I will never lack because you are my source in Jesus' Name, Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-16T00:00:00",
      "title": "The Spirit of Prayer",
      "anchor_scripture": "Luke 18:1",
      "memory_verse": "\"And he spake a parable unto them to this end, that men ought always to pray, and not to faint.\"",
      "beloved_message" : "We are living in times when it is so challenging to pray. When issues arise, we are so quick to call on every other person, before we call on God. Everybody is running around looking for how to make ends meet, and there is hardly enough time to just be still and fellowship with God. But if we must make a head way in this life, we can't do it outside God. Hence, we need to seek His face and know what He is saying to us. This we do in prayer. Prayer is beyond submitting a long list of petitions and needs to be met; prayer is deep communion with Him. It is that place where we become friends with God. And because we become His friends, He notices when we are not happy, and goes all out to make us joyful. He notices that we don't have enough food, so He supplies us. He notices how we don't have enough money, and He provides. God is too generous to withhold good things from us, but we will only get it in the place of fellowship, when our hearts genuinely chase Him. We need to keep the fire on our altars burning continuously by effectual, fervent and heartfelt prayer.",
      "further_reading": "Matthew 6:9-13",
      "prayer_mall": "Heavenly Father, I thank you for your word. I receive the Spirit of intercession to always pray and never faint in Jesus name. Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-7T00:00:00",
      "title": "Are you still saved?",
      "anchor_scripture": "Acts 16:30",
      "memory_verse": "\"And brought them out, and said, Sirs, what must I do to be saved?\"",
      "beloved_message" : "Salvation is God's gift to man. We didn't pay for it, neither did we initiate it. With the heart that believes and the mouth that confesses Jesus as Lord, one is saved. However, this is not all there is to it. From the jailer's encounter, we see that there are things you need to do to get saved, and remain saved. After Paul and Silas ministered salvation to Him, he brought them into his home, cleaned their wounds and refreshments them. Though we don't bring a wounded Jesus into our homes to nurse his wounds, but we bring Him into our homes and our lives to fellowship with Him. This is how we will remain saved. Don't believe the lie of the devil that because you said the prayer of salvation, you can go ahead still living a life of sin because there is grace. God's grace is not a license to sin, but a strength to help us overcome.",
      "further_reading": "Rev 3:20",
      "prayer_mall": "Heavenly Father, I thank you for your word. I receive the grace to walk closely with you until I see you in glory, in Jesus name. Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-18T00:00:00",
      "title": "No more shame",
      "anchor_scripture": "John 8:11",
      "memory_verse": "\"She said, No man, Lord. And Jesus said unto her, Neither do I condemn thee: go, and sin no more.\"",
      "beloved_message" : "Have you ever felt the guilt of condemnation? That is exactly how Peter felt that made him say to Jesus, \"depart from me for I am a sinful man\" (Luke 5:8). When we come to Jesus, and accept Him into our lives, we need to understand that our past is forgiven and forgotten. It is no use going back to remind God of your past when He has chosen to forget. Don't let the devil trap you in deception that God is still angry over that sin you committed in the past. That's s trick to keep you in bondage. God forgave you the moment you accepted Jesus, and that is all that matters. Don't let the lies of the enemy stop you from living in the freedom Jesus has given you on the cross of Calvary. God is not angry with you. Be joyful because your sins are forgiven.",
      "further_reading": "Luke 5:1-10",
      "prayer_mall": "Heavenly Father, I thank you for your word. I receive the the freedom you have given me from sin, and I refuse to let the devil hold me down by my past in Jesus name. Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-19T00:00:00",
      "title": "The gospel of peace",
      "anchor_scripture": "Romans 10:15",
      "memory_verse": "\"And how shall they preach, except they be sent? as it is written, How beautiful are the feet of them that preach the gospel of peace, and bring glad tidings of good things!\"",
      "beloved_message" : "The gospel is a message of peace and hope. It is not one that stirs up strife or wars; it is a message from a loving God who has chosen to reveal Himself to a dying world. However, the gospel is needs to be preached around the world, and people need to be sent. We are all sent, but while some of us are sent to our neighbourhoods, cities, offices, schools and streets, others are sent to nations beyond our borders and even near the edge of the world. The gospel is free, but the means to take it to the nations is not free. Everyday, missionaries stand in between that thin line that separates life from death. Their survival is very minimal, and their supplies are low. These are the real emissaries of the gospel, taking the message of peace to places ridden with war and bloodshed. Our duty as the body of Christ is to pray, give and support them. They don't need our pity; they need our prayers and partnership. Let us reach out to missionaries today by praying for them, and sending them our financial support.",
      "further_reading": "Phil. 4:15-19",
      "prayer_mall": "Heavenly Father, I thank you for your word. I pray for missionaries all over the world that their faith be strengthened, and Ii receive grace to support them constantly in my prayers and giving inJesus name. Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-20T00:00:00",
      "title": "Fellowship with God",
      "anchor_scripture": "1 Corinthians 1:9",
      "memory_verse": "\"God is faithful, by whom ye were called unto the fellowship of his Son Jesus Christ our Lord\"",
      "beloved_message" : "Before we are called to a life of service unto God, we are first called to a life of fellowship with Him. Before we are ever called to join the choir, ushering or sanitation departments in our local churches, we are called to first be with Him. God is pleased when He sees us working in His house, and helping others, but He is also very much interested in our fellowship with Him. While you are working with all your heart foe Him, don't be distracted like Martha who was too cumbered with chores that she had no time to sit at the feet of Jesus like Mary to listen to what was most important.",
      "further_reading": "Mark 3:14",
      "prayer_mall": "Heavenly Father, I thank you for your word. I receive grace to not replace my fellowship with you with my service for you in Jesus name. Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-21T00:00:00",
      "title": "God needs your resources",
      "anchor_scripture": "Luke 19:31",
      "memory_verse": "\"And if any man ask you, Why do ye loose him? thus shall ye say unto him, Because the Lord hath need of him.\"",
      "beloved_message" : "Giving our lives to Christ also includes giving Him the freedom to use our resources when there is a need in His house. A lot of people think that God only uses big things, but the size of your resource is not as important as the size of your heart. In the Bible, when Jesus needed to feed the multitude, He requested for the supplies of a little boy who had just five loaves of bread and two fishes. Don't think that resource is too small to give to God. What matters most is your heart as it gives.",
      "further_reading": "Luke 5:1-4",
      "prayer_mall": "Heavenly Father, I thank you for your word. I receive grace to give you my resources to propagate the gospel in the earth in Jesus name. Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-22T00:00:00",
      "title": "Where are the souls?",
      "anchor_scripture": "",
      "memory_verse": "\"\"",
      "beloved_message" : "When was the last time you preached the gospel on the bus? When was the last time you won a soul for Jesus? As believers, we are saved to serve and save others. God's kingdom grows when we preach the gospel, but most importantly, righteousness is established in our societies when we do so. When we fail to go all out and preach the gospel, we are indirectly giving room for the devil to recruit those lost souls into his army and use them to cause havoc and chaos in our societies, but when we shine our light, we light up our neighbourhood and enforce God's systems that bring peace, order and love amongst us. There are souls earnestly waiting for your manifestation as a son. God will require these souls from you.",
      "further_reading": "Romans 8:19",
      "prayer_mall": "Heavenly Father, I thank you for your word. I receive grace to preach the gospel wherever I go, and I receive a harvest of souls into your kingdom in Jesus name. Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-23T00:00:00",
      "title": "Just keep moving on",
      "anchor_scripture": "Deuteronomy 2:3",
      "memory_verse": "\"Ye have compassed this mountain long enough: turn you northward.\"",
      "beloved_message" : "Stagnancy is not of God. Obscurity is not of God. Remaining small is not of God. You need to understand that God made you to look like Him, and also be like Him. God is always doing something new everyday: changing lives, healing people, blessing children, lifting the heads of the downcast, giving hope to the hopeless and restoring what has been lost. He is always on the move. Stagnancy is a sign that you are comfortable with your past achievements, and you are not pressing for more. When the children of Israel remained in the wilderness, encompassing the mountain for too long, God spoke and said, hey! This is not where I have called you to be in; you've got to keep moving on if you want to reach that destination ahead of you. Don't stop now. You are closer than before. Don't give up now; there is surely a light at the end of the tunnel.",
      "further_reading": "Revelation 11:12",
      "prayer_mall": "Heavenly Father, I thank you for your word. I receive grace to keep moving on in spite of what the enemy throws at me. If you are for me, no one can be against me. I move on in Jesus name. Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-24T00:00:00",
      "title": "Who said?",
      "anchor_scripture": "Psalms 89:35",
      "memory_verse": "\"Once have I sworn by my holiness that I will not lie unto David\"",
      "beloved_message" : "All through scripture, we see the promises of God for our lives. Many times, we look at these things that have been written concerning us, and just like Mary, we wonder and think \"how shall this thing be?\" These promises are so big, and we look around us at all the smallness that surrounds us. But we should be comforted when we think of who has said these great things concerning us. Are these things hard for Him to do? No. They look impossible with us, but with Him, all things are possible. Halleluyah! Our duty is to believe and trust in Him until He comes through for us.",
      "further_reading": "Jeremiah 29:11",
      "prayer_mall": "Heavenly Father, I thank you for your word. I receive grace to never doubt your promises concerning my life in Jesus name. Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-25T00:00:00",
      "title": "Secured in your call",
      "anchor_scripture": "John 3:26",
      "memory_verse": "\"And they came unto John, and said unto him, Rabbi, he that was with thee beyond Jordan, to whom thou barest witness, behold, the same baptizeth, and all men come to him.\"",
      "beloved_message" : "In this kingdom, there are diverse gifts in every believer. The enemy sometimes makes us envious of one another's gifts, and blinds us from seeing that no gift is superior or inferior to another. One of the traps of the devil is the comparison trap. He will make you believe that someone else is doing better than you. But you need to stop and tell yourself \"I am not in a competition\". In the body of Christ, we are meant to complement one another and not compete with one another or compare our gifts to see which is greater. The heart of the Father isn't going after matters that breed envy and strife amongst us. We should be chasing the most important things and not focusing the spotlight on ourselves. Refuse to be pressured into envy. Refuse to allow the enemy make you feel inferior. Whatever gift God has give to you, be faithful. This is what really matters.",
      "further_reading": "2 Corinthians 10:12",
      "prayer_mall": "Heavenly Father, I thank you for your word. I receive grace to in my call, and in the area you have called me to serve you in Jesus name. Amen",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-26T00:00:00",
      "title": "Confront that fear",
      "anchor_scripture": "2 Timothy 1:7",
      "memory_verse": "\"For God hath not given us the spirit of fear; but of power, and of love, and of a sound mind.\"",
      "beloved_message" : "Fear is not of God. It is the devil's tool to keep us in doubt of God's security over our lives. Satan has numerous gimmicks to keep us afraid and in doubt, but we overcome him by the word of God. The devil is the master of this flesh realm, and he knows every single panic button to tap to cause us to become afraid and doubt God, but we are not moved by the flesh but by the Spirit of God. The thought of God's exceeding love for you should drive out every kind of fear You cannot remain afraid of that fear forever. It is time to stand on God's word and address that spirit of fear.",
      "further_reading": "1 John 4:18",
      "prayer_mall": "Heavenly Father, I thank you for your word. I receive grace to be bold as a lion and not be afraid. My heart rests and trusts in you in Jesus name. Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-27T00:00:00",
      "title": "Let Go, Let God",
      "anchor_scripture": "Pro 16:3",
      "memory_verse": "\"Commit your works to the Lord and your thoughts will be established.\"",
      "beloved_message" : "When God is at the centre of your work, It can never fall apart. Most people struggle in business and life endeavours because they feel God has nothing to do with it. God owns everything and everyone. When you commit your work to him, it means you acknowledge him as the source. Let go and let God remove that struggle and give you a grace ride. Are you a student, business person corporate worker, you need to commit your work to God. The establishment can only come when you've committed your work to him. Let God lead you, then watch him make a way that will beat your imagination. Only God can deliver beyond your plan.",
      "further_reading": "Pro 16, Ps 3",
      "prayer_mall": "Heavenly Father, thank you for your word. I commit all my endeavours to you Lord, have your way and replace my struggle with Grace. In Jesus  Name. Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-28T00:00:00",
      "title": "My Sheep hears my Voice",
      "anchor_scripture": "John10:3",
      "memory_verse": "\"\"",
      "beloved_message" : "God is our ultimate Shepard and we are his sheep. The shepherd leads the sheep and guides them out of danger. When a sheep fails to hear from the shepherd the sheep obviously heads for the wrong path. As the shepherd speaks direction daily to his sheep so God speaks to us and lead us on his path daily. The only reason any child of God will lose direction is that he or she stops hearing from God. The unbelievers are lost because they do not hear from their maker. One sure way God speaks directly to his sheep is through the Bible, so don't say God is silent when your bible is closed. Your constant fellowship with God through his word make you recognize his voice and not obey any other voice. Never substitute the fellowship through his word with any other spiritual activity. Study and let the word come alive in you.",
      "further_reading": "John10. Ps 23",
      "prayer_mall": "Heavenly Father, Thank you for your word. I receive grace to keep a constant relationship through your Word. In Jesus Name Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-29T00:00:00",
      "title": "First Things First",
      "anchor_scripture": "1Cor 14:40",
      "memory_verse": "\"Let all things be done decently and in order\"",
      "beloved_message" : "God wants order in his house, but in as much as that is needed in his house, orderliness has to first have its course in the life of every one of his children. We exist in a time where we have to do a lot of things to survive and a lot of things demand our attention. Nevertheless, our best is still required by God and this can only happen when there is order in our lives. You need to know what is important, necessary, urgent and unimportant. Your inability to figure out all these will make you exert your energy on things that are less productive and other  important things needed to move your life forward will be left undone. You need to rely on God to lead you because there are things anyway that seems right that is not the right way. God knows we will face such that's why he said we should seek first the kingdom.",
      "further_reading": "I Cor14, Ps 15",
      "prayer_mall": "Heavenly Father, Thank you for your word. Deliver me from every wrong decision have made. In Jesus Name Amen",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-30T00:00:00",
      "title": "Purpose with counsel",
      "anchor_scripture": "Pro 20:18",
      "memory_verse": "\"The heart of a man plans his way but the Lord directs his step.\"",
      "beloved_message" : "No matter how beautiful your plan is you need good counsel to help serve as manure to help make it grow. No man knows it all. You need others to help give you the right direction on how to better actualize your plan. Your first and ultimate source of counsel is the word of God. It will never lead you astray, it will never be bias neither will it have ulterior motives. \"Your word is a lamp unto my feet and a light unto my path\" that's what the psalmist said. You can't go far in the dark no matter how beautiful the road or journey. No matter what your purpose and plans are, God is the master planner. Seek him and get counsel today.",
      "further_reading": "Pro20, Ps50, Ezk30",
      "prayer_mall": "Heavenly Father, Thank you for your word. Direct my path and order my steps in your word. In Jesus Name. Amen.",
      "display_image": "sunset2"
    },
    {
      "date": "2020-10-31T00:00:00",
      "title": "Finishing Strong",
      "anchor_scripture": "2 Timothy 4:7",
      "memory_verse": "\"I have fought a good fight, I have finished my course, I have kept the faith\"",
      "beloved_message" : "Today is the last day in the month of October. It has been thirty one days of God's unending goodness and relentless love. God has been faithful and we are especially grateful unto Him. But looking back at this month, would you say you have accomplished all you set out to do at the beginning of it? When God needed Jesus to come to earth and die on the cross of Calvary for us, Jesus did, and in the end, He finished strong and brought glory to God. God is not glorified in the unfinished projects you have abandoned; the temple wasn't dedicated until it was completed, and when Solomon prayed, God's glory came upon the house. It is time to take a review of your October and see if you were fruitful in your efforts. You need to finish strong and bring glory to God.",
      "further_reading": "Ecclesiastes 7:8",
      "prayer_mall": "Heavenly Father, I thank you for your word. I receive grace to finish strong and finish well in Jesus name. Amen.",
      "display_image": "sunset2"
    }
]